WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Begin is 0, normalize the others too
  fullCycle = endCaptrUi64 - beginCaptrUi64;
  halfCycle = midCaptrUi64 - beginCaptrUi64;

  // To help preserve resolution, use floating point math.
  syslog(1, "==>%s@%d-Snapshot-full Count:%llu, half Count:%llu, inputTotal:%llu\n",
            __FILE__, __LINE__,
            fullCycle, halfCycle,
            mdwFreqChanData->totalGpioPulses);

  // Duty Cycle is the ratio of the full cycle count and the cycle count
  // before the trailing edge was detected.
  dblDutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);

  // The dblFrequency is the timer's clock divided by the cycle count.
  dblFrequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)fullCycle);

  // Average frequency since last read calculations
  uint64_t totalCaptureTime = endCaptureTime - startCaptureTime;
  // Convert nanoseconds to fractional seconds
  double dblTotalCaptureTime = ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqChanData->totalGpioPulses;
  dblAverageFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  syslog(2, "==>AvgFreq:%6.2f, Since last read, GpioCnt:%llu\n",
            dblAverageFreq,
            mdwFreqChanData->totalGpioPulses);

  syslog(2, "In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.8f, Count:%lu\n",
            dblFrequency, dblDutyCycle, dblAverageFreq,
            (uint32_t)dblTotalInputCount);

  returnData->frequencyX1000  = (dblFrequency * 1000.0);
  returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  returnData->avgFreqX1000    = (dblAverageFreq * 1000.0);
  returnData->totalGpioPulses = (uint32_t)dblTotalInputCount;

  // Reset capture counts for new average calc
  mdwFreqChanData->totalGpioPulses = 0;

  // There's a bug here. Need to save time for every channel configured
  startCaptureTime = meadow_measure_freq_get_current_time();

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
